app/Controllers/Mahasiswa.php

INSERT INTO `users` (`nama`, `nim`, `nomorhp`, `email`, `role`, `password`) VALUES ('Fuji', '21.01.4650', '08122324234', 'fuji@gmail.com', 'mahasiswa', '$2y$10$oDpy/ArzgBKQglYjKA4GRe/slpophEfOd7NT.Yh0A5O.D7gUQ/Hs6')
---
            'password' => password_hash($request->getPost('password'), PASSWORD_DEFAULT),
        ];
        $mahasiswa = new \App\Models\Users();
        $mahasiswa->insert($data);