app/Controllers/News.php

SELECT *
FROM `news`
---
    public function index()
    {
        $data['news'] = $this->newsModel->findAll();